apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k1xx_lpi2c.h
/****************************************************************************
 * arch/arm/src/s32k1xx/hardware/s32k1xx_lpi2c.h
 *
 *    Copyright (C) 2019 Gregory Nutt. All rights reserved.
 *    Author: Ivan Ucherdzhiev <ivanucherdjiev@gmail.com>
 *            Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_S32K1XX_HARDWARE_S32K1XX_LPI2C_H
#define __ARCH_ARM_SRC_S32K1XX_HARDWARE_S32K1XX_LPI2C_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "hardware/s32k1xx_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define S32K1XX_LPI2C_VERID_OFFSET          0x0000  /* Version ID Register offset */
#define S32K1XX_LPI2C_PARAM_OFFSET          0x0004  /* Parameter Register offset */
#define S32K1XX_LPI2C_MCR_OFFSET            0x0010  /* Master Control Register offset */
#define S32K1XX_LPI2C_MSR_OFFSET            0x0014  /* Master Status Register offset */
#define S32K1XX_LPI2C_MIER_OFFSET           0x0018  /* Master Interrupt Enable Register offset */
#define S32K1XX_LPI2C_MDER_OFFSET           0x001c  /* Master DMA Enable Register offset */
#define S32K1XX_LPI2C_MCFGR0_OFFSET         0x0020  /* Master Config Register 0 offset */
#define S32K1XX_LPI2C_MCFGR1_OFFSET         0x0024  /* Master Config Register 1 offset */
#define S32K1XX_LPI2C_MCFGR2_OFFSET         0x0028  /* Master Config Register 2 offset */
#define S32K1XX_LPI2C_MCFGR3_OFFSET         0x002c  /* Master Config Register 3 offset */
#define S32K1XX_LPI2C_MDMR_OFFSET           0x0040  /* Master Data Match Register offset */
#define S32K1XX_LPI2C_MCCR0_OFFSET          0x0048  /* Master Clock Configuration Register 0 offset */
#define S32K1XX_LPI2C_MCCR1_OFFSET          0x0050  /* Master Clock Configuration Register 1 offset */
#define S32K1XX_LPI2C_MFCR_OFFSET           0x0058  /* Master FIFO Control Register offset */
#define S32K1XX_LPI2C_MFSR_OFFSET           0x005c  /* Master FIFO Status Register offset */
#define S32K1XX_LPI2C_MTDR_OFFSET           0x0060  /* Master Transmit Data Register offset */
#define S32K1XX_LPI2C_MRDR_OFFSET           0x0070  /* Master Receive Data Register offset */
#define S32K1XX_LPI2C_SCR_OFFSET            0x0110  /* Slave Control Register offset */
#define S32K1XX_LPI2C_SSR_OFFSET            0x0114  /* Slave Status Register offset */
#define S32K1XX_LPI2C_SIER_OFFSET           0x0118  /* Slave Interrupt Enable Register offset */
#define S32K1XX_LPI2C_SDER_OFFSET           0x011c  /* Slave DMA Enable Register offset */
#define S32K1XX_LPI2C_SCFGR1_OFFSET         0x0124  /* Slave Config Register 1 offset */
#define S32K1XX_LPI2C_SCFGR2_OFFSET         0x0128  /* Slave Config Register 2 offset */
#define S32K1XX_LPI2C_SAMR_OFFSET           0x0140  /* Slave Address Match Register offset */
#define S32K1XX_LPI2C_SASR_OFFSET           0x0150  /* Slave Address Status Register offset */
#define S32K1XX_LPI2C_STAR_OFFSET           0x0154  /* Slave Transmit ACK Register offset */
#define S32K1XX_LPI2C_STDR_OFFSET           0x0160  /* Slave Transmit Data Register offset */
#define S32K1XX_LPI2C_SRDR_OFFSET           0x0170  /* Slave Receive Data Register offset */

/* Register addresses *******************************************************/

/* LPI2C0 Registers */

#define S32K1XX_LPI2C0_VERID                (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_VERID_OFFSET)   /* Version ID Register */
#define S32K1XX_LPI2C0_PARAM                (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_PARAM_OFFSET)   /* Parameter Register  */
#define S32K1XX_LPI2C0_MCR                  (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_MCR_OFFSET)     /* Master Control Register  */
#define S32K1XX_LPI2C0_MSR                  (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_MSR_OFFSET)     /* Master Status Register  */
#define S32K1XX_LPI2C0_MIER                 (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_MIER_OFFSET)    /* Master Interrupt Enable Register  */
#define S32K1XX_LPI2C0_MDER                 (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_MDER_OFFSET)    /* Master DMA Enable Register  */
#define S32K1XX_LPI2C0_MCFGR0               (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_MCFGR0_OFFSET)  /* Master Config Register 0  */
#define S32K1XX_LPI2C0_MCFGR1               (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_MCFGR1_OFFSET)  /* Master Config Register 1  */
#define S32K1XX_LPI2C0_MCFGR2               (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_MCFGR2_OFFSET)  /* Master Config Register 2  */
#define S32K1XX_LPI2C0_MCFGR3               (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_MCFGR3_OFFSET)  /* Master Config Register 3  */
#define S32K1XX_LPI2C0_MDMR                 (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_MDMR_OFFSET)    /* Master Data Match Register  */
#define S32K1XX_LPI2C0_MCCR0                (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_MCCR0_OFFSET)   /* Master Clock Configuration Register 0  */
#define S32K1XX_LPI2C0_MCCR1                (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_MCCR1_OFFSET)   /* Master Clock Configuration Register 1  */
#define S32K1XX_LPI2C0_MFCR                 (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_MFCR_OFFSET)    /* Master FIFO Control Register  */
#define S32K1XX_LPI2C0_MFSR                 (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_MFSR_OFFSET)    /* Master FIFO Status Register  */
#define S32K1XX_LPI2C0_MTDR                 (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_MTDR_OFFSET)    /* Master Transmit Data Register  */
#define S32K1XX_LPI2C0_MRDR                 (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_MRDR_OFFSET)    /* Master Receive Data Register  */
#define S32K1XX_LPI2C0_SCR                  (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_SCR_OFFSET)     /* Slave Control Register  */
#define S32K1XX_LPI2C0_SSR                  (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_SSR_OFFSET)     /* Slave Status Register  */
#define S32K1XX_LPI2C0_SIER                 (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_SIER_OFFSET)    /* Slave Interrupt Enable Register  */
#define S32K1XX_LPI2C0_SDER                 (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_SDER_OFFSET)    /* Slave DMA Enable Register  */
#define S32K1XX_LPI2C0_SCFGR1               (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_SCFGR1_OFFSET)  /* Slave Config Register 1  */
#define S32K1XX_LPI2C0_SCFGR2               (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_SCFGR2_OFFSET)  /* Slave Config Register 2  */
#define S32K1XX_LPI2C0_SAMR                 (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_SAMR_OFFSET)    /* Slave Address Match Register  */
#define S32K1XX_LPI2C0_SASR                 (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_SASR_OFFSET)    /* Slave Address Status Register  */
#define S32K1XX_LPI2C0_STAR                 (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_STAR_OFFSET)    /* Slave Transmit ACK Register  */
#define S32K1XX_LPI2C0_STDR                 (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_STDR_OFFSET)    /* Slave Transmit Data Register  */
#define S32K1XX_LPI2C0_SRDR                 (S32K1XX_LPI2C0_BASE + S32K1XX_LPI2C_SRDR_OFFSET)    /* Slave Receive Data Register  */

/* LPI2C1 Registers */

