apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k1xx_lpi2c.h
#define S32K1XX_LPI2C1_VERID                (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_VERID_OFFSET)   /* Version ID Register */
#define S32K1XX_LPI2C1_PARAM                (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_PARAM_OFFSET)   /* Parameter Register  */
#define S32K1XX_LPI2C1_MCR                  (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_MCR_OFFSET)     /* Master Control Register  */
#define S32K1XX_LPI2C1_MSR                  (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_MSR_OFFSET)     /* Master Status Register  */
#define S32K1XX_LPI2C1_MIER                 (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_MIER_OFFSET)    /* Master Interrupt Enable Register  */
#define S32K1XX_LPI2C1_MDER                 (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_MDER_OFFSET)    /* Master DMA Enable Register  */
#define S32K1XX_LPI2C1_MCFGR0               (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_MCFGR0_OFFSET)  /* Master Config Register 0  */
#define S32K1XX_LPI2C1_MCFGR1               (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_MCFGR1_OFFSET)  /* Master Config Register 1  */
#define S32K1XX_LPI2C1_MCFGR2               (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_MCFGR2_OFFSET)  /* Master Config Register 2  */
#define S32K1XX_LPI2C1_MCFGR3               (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_MCFGR3_OFFSET)  /* Master Config Register 3  */
#define S32K1XX_LPI2C1_MDMR                 (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_MDMR_OFFSET)    /* Master Data Match Register  */
#define S32K1XX_LPI2C1_MCCR0                (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_MCCR0_OFFSET)   /* Master Clock Configuration Register 0  */
#define S32K1XX_LPI2C1_MCCR1                (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_MCCR1_OFFSET)   /* Master Clock Configuration Register 1  */
#define S32K1XX_LPI2C1_MFCR                 (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_MFCR_OFFSET)    /* Master FIFO Control Register  */
#define S32K1XX_LPI2C1_MFSR                 (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_MFSR_OFFSET)    /* Master FIFO Status Register  */
#define S32K1XX_LPI2C1_MTDR                 (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_MTDR_OFFSET)    /* Master Transmit Data Register  */
#define S32K1XX_LPI2C1_MRDR                 (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_MRDR_OFFSET)    /* Master Receive Data Register  */
#define S32K1XX_LPI2C1_SCR                  (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_SCR_OFFSET)     /* Slave Control Register  */
#define S32K1XX_LPI2C1_SSR                  (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_SSR_OFFSET)     /* Slave Status Register  */
#define S32K1XX_LPI2C1_SIER                 (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_SIER_OFFSET)    /* Slave Interrupt Enable Register  */
#define S32K1XX_LPI2C1_SDER                 (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_SDER_OFFSET)    /* Slave DMA Enable Register  */
#define S32K1XX_LPI2C1_SCFGR1               (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_SCFGR1_OFFSET)  /* Slave Config Register 1  */
#define S32K1XX_LPI2C1_SCFGR2               (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_SCFGR2_OFFSET)  /* Slave Config Register 2  */
#define S32K1XX_LPI2C1_SAMR                 (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_SAMR_OFFSET)    /* Slave Address Match Register  */
#define S32K1XX_LPI2C1_SASR                 (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_SASR_OFFSET)    /* Slave Address Status Register  */
#define S32K1XX_LPI2C1_STAR                 (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_STAR_OFFSET)    /* Slave Transmit ACK Register  */
#define S32K1XX_LPI2C1_STDR                 (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_STDR_OFFSET)    /* Slave Transmit Data Register  */
#define S32K1XX_LPI2C1_SRDR                 (S32K1XX_LPI2C1_BASE + S32K1XX_LPI2C_SRDR_OFFSET)    /* Slave Receive Data Register  */

/* Register bit definitions *************************************************/

/* LPI2C Version ID Register */

#define LPI2C_VERID_FEATURE_SHIFT           (0)
#define LPI2C_VERID_FEATURE_MASK            (0xffff << LPI2C_VERID_FEATURE_SHIFT)
#define LPI2C_VERID_MINOR_SHIFT             (16)
#define LPI2C_VERID_MINOR_MASK              (0xff << LPI2C_VERID_MINOR_SHIFT)
#define LPI2C_VERID_MAJOR_SHIFT             (24)
#define LPI2C_VERID_MAJOR_MASK              (0xff << LPI2C_VERID_MAJOR_SHIFT)

/* LPI2C Parameter Register  */

#define LPI2C_PARAM_MTXFIFO_MASK            (0x0f)    /* Bits 0-3:  Master Transmit FIFO Size */
#  define LPI2C_PARAM_MTXFIFO_1_WORDS       (0)
#  define LPI2C_PARAM_MTXFIFO_2_WORDS       (1)
#  define LPI2C_PARAM_MTXFIFO_4_WORDS       (2)
#  define LPI2C_PARAM_MTXFIFO_8_WORDS       (3)
#  define LPI2C_PARAM_MTXFIFO_16_WORDS      (4)
#  define LPI2C_PARAM_MTXFIFO_32_WORDS      (5)
#  define LPI2C_PARAM_MTXFIFO_64_WORDS      (6)
#  define LPI2C_PARAM_MTXFIFO_128_WORDS     (7)
#  define LPI2C_PARAM_MTXFIFO_256_WORDS     (8)
#  define LPI2C_PARAM_MTXFIFO_512_WORDS     (9)
#  define LPI2C_PARAM_MTXFIFO_1024_WORDS    (10)
#  define LPI2C_PARAM_MTXFIFO_2048_WORDS    (11)
#  define LPI2C_PARAM_MTXFIFO_4096_WORDS    (12)
#  define LPI2C_PARAM_MTXFIFO_8192_WORDS    (13)
#  define LPI2C_PARAM_MTXFIFO_16384_WORDS   (14)
#  define LPI2C_PARAM_MTXFIFO_32768_WORDS   (15)
#define LPI2C_PARAM_MRXFIFO_SHIFT           (8)       /* Bits 8-11:  Master Receive FIFO Size */
#define LPI2C_PARAM_MRXFIFO_MASK            (0x0f << LPI2C_PARAM_MRXFIFO_SHIFT)
#  define LPI2C_PARAM_MRXFIFO_1_WORDS       (0 << LPI2C_PARAM_MRXFIFO_SHIFT)
#  define LPI2C_PARAM_MRXFIFO_2_WORDS       (1 << LPI2C_PARAM_MRXFIFO_SHIFT)
#  define LPI2C_PARAM_MRXFIFO_4_WORDS       (2 << LPI2C_PARAM_MRXFIFO_SHIFT)
#  define LPI2C_PARAM_MRXFIFO_8_WORDS       (3 << LPI2C_PARAM_MRXFIFO_SHIFT)
#  define LPI2C_PARAM_MRXFIFO_16_WORDS      (4 << LPI2C_PARAM_MRXFIFO_SHIFT)
#  define LPI2C_PARAM_MRXFIFO_32_WORDS      (5 << LPI2C_PARAM_MRXFIFO_SHIFT)
#  define LPI2C_PARAM_MRXFIFO_64_WORDS      (6 << LPI2C_PARAM_MRXFIFO_SHIFT)
#  define LPI2C_PARAM_MRXFIFO_128_WORDS     (7 << LPI2C_PARAM_MRXFIFO_SHIFT)
#  define LPI2C_PARAM_MRXFIFO_256_WORDS     (8 << LPI2C_PARAM_MRXFIFO_SHIFT)
#  define LPI2C_PARAM_MRXFIFO_512_WORDS     (9 << LPI2C_PARAM_MRXFIFO_SHIFT)
#  define LPI2C_PARAM_MRXFIFO_1024_WORDS    (10 << LPI2C_PARAM_MRXFIFO_SHIFT)
#  define LPI2C_PARAM_MRXFIFO_2048_WORDS    (11 << LPI2C_PARAM_MRXFIFO_SHIFT)
#  define LPI2C_PARAM_MRXFIFO_4096_WORDS    (12 << LPI2C_PARAM_MRXFIFO_SHIFT)
#  define LPI2C_PARAM_MRXFIFO_8192_WORDS    (13 << LPI2C_PARAM_MRXFIFO_SHIFT)
#  define LPI2C_PARAM_MRXFIFO_16384_WORDS   (14 << LPI2C_PARAM_MRXFIFO_SHIFT)
#  define LPI2C_PARAM_MRXFIFO_32768_WORDS   (15 << LPI2C_PARAM_MRXFIFO_SHIFT)

/* LPI2C Master Control Register  */

#define LPI2C_MCR_MEN                       (1 << 0)  /* Master Enable Bit */
#define LPI2C_MCR_RST                       (1 << 1)  /* Software Reset Bit */
#define LPI2C_MCR_DOZEN                     (1 << 2)  /* Doze Mode Enable Bit */
#define LPI2C_MCR_DBGEN                     (1 << 3)  /* Debug Enable Bit */
                                                      /* Bits 7-4 Reserved */
#define LPI2C_MCR_RTF                       (1 << 8)  /* Reset Transmit FIFO Bit */
#define LPI2C_MCR_RRF                       (1 << 9)  /* Reset Receive FIFO Bit */
                                                      /* Bits 31-10 Reserved */

/* LPI2C Master Status Register  */

#define LPI2C_MSR_TDF                       (1 << 0)  /* Transmit Data Flag Bit */
#define LPI2C_MSR_RDF                       (1 << 1)  /* Receive Data Flag Bit */
                                                      /* Bits 7-2 Reserved */
#define LPI2C_MSR_EPF                       (1 << 8)  /* End Packet Flag Bit */
#define LPI2C_MSR_SDF                       (1 << 9)  /* STOP Detect Flag Bit */
#define LPI2C_MSR_NDF                       (1 << 10) /* NACK Detect Flag Bit */
#define LPI2C_MSR_ALF                       (1 << 11) /* Arbitration Lost Flag Bit */
#define LPI2C_MSR_FEF                       (1 << 12) /* FIFO Error Flag Bit */
#define LPI2C_MSR_PLTF                      (1 << 13) /* Pin Low Timeout Flag Bit */
#define LPI2C_MSR_DMF                       (1 << 14) /* Data Match Flag Bit */
                                                      /* Bits 23-15 Reserved */
#define LPI2C_MSR_MBF                       (1 << 24) /* Master Busy Flag Bit */
#define LPI2C_MSR_BBF                       (1 << 25) /* Bus Busy Flag Bit */
                                                      /* Bits 31-26 Reserved */
#define LPI2C_MSR_ERROR_MASK                (LPI2C_MSR_NDF | LPI2C_MSR_ALF | \
                                             LPI2C_MSR_FEF)

/* LPI2C Master Interrupt Enable Register  */

#define LPI2C_MIER_TDIE                     (1 << 0)  /* Transmit Data Interrupt Enable Bit */
#define LPI2C_MIER_RDIE                     (1 << 1)  /* Receive Data Interrupt Enable Bit */
                                                      /* Bits 7-2 Reserved */
#define LPI2C_MIER_EPIE                     (1 << 8)  /* End Packet Interrupt Enable Bit */
#define LPI2C_MIER_SDIE                     (1 << 9)  /* STOP Detect Interrupt Enable Bit */
#define LPI2C_MIER_NDIE                     (1 << 10) /* NACK Detect Interrupt Enable Bit */
#define LPI2C_MIER_ALIE                     (1 << 11) /* Arbitration Lost Interrupt Enable Bit */
#define LPI2C_MIER_FEIE                     (1 << 12) /* FIFO Error Interrupt Enable Bit */
#define LPI2C_MIER_PLTIE                    (1 << 13) /* Pin Low Timeout Interrupt Enable Bit */
#define LPI2C_MIER_DMIE                     (1 << 14) /* Data Match Interrupt Enable Bit */
                                                      /* Bits 31-15 Reserved */

