apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k1xx_lpi2c.h
/* LPI2C Master DMA Enable Register  */

#define LPI2C_MDER_TDDE                     (1 << 0)  /* Transmit Data DMA Enable Bit */
#define LPI2C_MDER_RDDE                     (1 << 1)  /* Transmit Data DMA Enable Bit */
                                                      /* Bits 31-2 Reserved */

/* LPI2C Master Config Register 0  */

#define LPI2C_MCFG0_HREN                    (1 << 0)  /* Host Request Enable Bit */
#define LPI2C_MCFG0_HRPOL                   (1 << 1)  /* Host Request Polarity Bit */
#define LPI2C_MCFG0_HRSEL                   (1 << 2)  /* Host Request Select Bit */
                                                      /* Bits 7-3 Reserved */
#define LPI2C_MCFG0_CIRFIFO                 (1 << 8)  /* Circular FIFO Enable Bit */
#define LPI2C_MCFG0_RDMO                    (1 << 9)  /* Receive Data Match Only Bit */
                                                      /* Bits 31-10 Reserved */

/* LPI2C Master Config Register 1  */

#define LPI2C_MCFGR1_PRESCALE_MASK          (7 << 0)  /* Clock Prescaler Bit Mask */
#  define LPI2C_MCFGR1_PRESCALE(n)          (n & LPI2C_MCFGR1_PRESCALE_MASK)
#  define LPI2C_MCFGR1_PRESCALE_1           (0)
#  define LPI2C_MCFGR1_PRESCALE_2           (1)
#  define LPI2C_MCFGR1_PRESCALE_4           (2)
#  define LPI2C_MCFGR1_PRESCALE_8           (3)
#  define LPI2C_MCFGR1_PRESCALE_16          (4)
#  define LPI2C_MCFGR1_PRESCALE_32          (5)
#  define LPI2C_MCFGR1_PRESCALE_64          (6)
#  define LPI2C_MCFGR1_PRESCALE_128         (7)
#define LPI2C_MCFGR1_AUTOSTOP               (1 << 8)  /* Automatic STOP Generation Bit */
#define LPI2C_MCFGR1_IGNACK                 (1 << 9)  /* Ignore NACK Bit */
#define LPI2C_MCFGR1_TIMECFG                (1 << 10) /* Timeout Configuration Bit */
                                                      /* Bits 15-11 Reserved */
#define LPI2C_MCFGR1_MATCFG_SHIFT           (16)
#define LPI2C_MCFGR1_MATCFG_MASK            (7 << LPI2C_MCFGR1_MATCFG_SHIFT)  /* Match Configuration Bit Mask */
#  define LPI2C_MCFGR1_MATCFG(n)            ((n << LPI2C_MCFGR1_MATCFG_SHIFT) & LPI2C_MCFGR1_MATCFG_MASK)
#  define LPI2C_MCFGR1_MATCFG_DISABLE       (0 << LPI2C_MCFGR1_MATCFG_SHIFT)
                                                     /* LPI2C_MCFG1_MATCFG = 001b Reserved */
#  define LPI2C_MCFGR1_MATCFG2              (2 << LPI2C_MCFGR1_MATCFG_SHIFT)
#  define LPI2C_MCFGR1_MATCFG3              (3 << LPI2C_MCFGR1_MATCFG_SHIFT)
#  define LPI2C_MCFGR1_MATCFG4              (4 << LPI2C_MCFGR1_MATCFG_SHIFT)
#  define LPI2C_MCFGR1_MATCFG5              (5 << LPI2C_MCFGR1_MATCFG_SHIFT)
#  define LPI2C_MCFGR1_MATCFG6              (6 << LPI2C_MCFGR1_MATCFG_SHIFT)
#  define LPI2C_MCFGR1_MATCFG7              (7 << LPI2C_MCFGR1_MATCFG_SHIFT)
                                                    /* Bits 23-19 Reserved */
#define LPI2C_MCFGR1_PINCFG_SHIFT           (24)
#define LPI2C_MCFGR1_PINCFG_MASK            (7 << LPI2C_MCFGR1_PINCFG_SHIFT)  /* Pin Configuration Bit Mask */
#  define LPI2C_MCFGR1_PINCFG(n)            ((n << LPI2C_MCFGR1_PINCFG_SHIFT) & LPI2C_MCFGR1_PINCFG_MASK)
#  define LPI2C_MCFGR1_PINCFG0              (0 << LPI2C_MCFGR1_PINCFG_SHIFT)
#  define LPI2C_MCFGR1_PINCFG1              (1 << LPI2C_MCFGR1_PINCFG_SHIFT)
#  define LPI2C_MCFGR1_PINCFG2              (2 << LPI2C_MCFGR1_PINCFG_SHIFT)
#  define LPI2C_MCFGR1_PINCFG3              (3 << LPI2C_MCFGR1_PINCFG_SHIFT)
#  define LPI2C_MCFGR1_PINCFG4              (4 << LPI2C_MCFGR1_PINCFG_SHIFT)
#  define LPI2C_MCFGR1_PINCFG5              (5 << LPI2C_MCFGR1_PINCFG_SHIFT)
#  define LPI2C_MCFGR1_PINCFG6              (6 << LPI2C_MCFGR1_PINCFG_SHIFT)
#  define LPI2C_MCFGR1_PINCFG7              (7 << LPI2C_MCFGR1_PINCFG_SHIFT)
                                                    /* Bits 31-27 Reserved */

/* LPI2C Master Config Register 2  */

#define LPI2C_MCFG2_BUSIDLE_MASK            (0xfff << 0)  /* Bus Idle Timeout Period in Clock Cycles */
#define LPI2C_MCFG2_BUSIDLE_DISABLE         (0)
#  define LPI2C_MCFG2_BUSIDLE(n)            (n & LPI2C_MCFG2_BUSIDLE_MASK)
                                                     /* Bits 15-12 Reserved */
#define LPI2C_MCFG2_FILTSCL_SHIFT           (16)
#define LPI2C_MCFG2_FILTSCL_MASK            (15 << LPI2C_MCFG2_FILTSCL_SHIFT)  /* Glitch Filter SCL */
#define LPI2C_MCFG2_FILTSCL_DISABLE         (0 << LPI2C_MCFG2_FILTSCL_SHIFT)
#  define LPI2C_MCFG2_FILTSCL_CYCLES(n)     ((n << LPI2C_MCFG2_FILTSCL_SHIFT) & LPI2C_MCFG2_FILTSCL_MASK)
                                                     /* Bits 23-20 Reserved */
#define LPI2C_MCFG2_FILTSDA_SHIFT           (24)
#define LPI2C_MCFG2_FILTSDA_MASK            (15 << LPI2C_MCFG2_FILTSDA_SHIFT)  /* Glitch Filter SDA */
#define LPI2C_MCFG2_FILTSDA_DISABLE         (0 << LPI2C_MCFG2_FILTSDA_SHIFT)
#  define LPI2C_MCFG2_FILTSDA_CYCLES(n)     ((n << LPI2C_MCFG2_FILTSDA_SHIFT) & LPI2C_MCFG2_FILTSDA_MASK)
                                                     /* Bits 31-28 Reserved */

/* LPI2C Master Config Register 3  */

                                                     /* Bits 7-0 Reserved */
#define LPI2C_MCFG3_PINLOW_SHIFT            (8)
#define LPI2C_MCFG3_PINLOW_MASK             (0xfff << LPI2C_MCFG3_PINLOW_SHIFT)  /* Configure The Pin Low Timeout in Clock Cycles */
#  define LPI2C_MCFG3_PINLOW_CYCLES(n)      ((n << LPI2C_MCFG3_PINLOW_SHIFT) & LPI2C_MCFG3_PINLOW_MASK)
                                                     /* Bits 31-20 Reserved */

/* LPI2C Master Data Match Register  */

#define LPI2C_MDMR_MATCH0_SHIFT             (0)
#define LPI2C_MDMR_MATCH0_MASK              (0xff << LPI2C_MDMR_MATCH0_SHIFT)  /* Match 0 Value */
#  define LPI2C_MDMR_MATCH0(n)              ((n << LPI2C_MDMR_MATCH0_SHIFT) & LPI2C_MDMR_MATCH0_MASK)
                                                     /* Bits 15-8 Reserved */
#define LPI2C_MDMR_MATCH1_SHIFT             (16)
#define LPI2C_MDMR_MATCH1_MASK              (0xff << LPI2C_MDMR_MATCH1_SHIFT)  /* Match 1 Value */
#  define LPI2C_MDMR_MATCH1(n)              ((n << LPI2C_MDMR_MATCH1_SHIFT) & LPI2C_MDMR_MATCH1_MASK)
                                                     /* Bits 31-24 Reserved */

