apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k1xx_lpi2c.h
/* LPI2C Master Clock Configuration Register 0 */

#define LPI2C_MCCR0_CLKLO_SHIFT             (0)
#define LPI2C_MCCR0_CLKLO_MASK              (0x3f << LPI2C_MCCR0_CLKLO_SHIFT)  /* Clock Low Period */
#  define LPI2C_MCCR0_CLKLO(n)              ((n << LPI2C_MCCR0_CLKLO_SHIFT) & LPI2C_MCCR0_CLKLO_MASK)
                                                     /* Bits 7-6 Reserved */
#define LPI2C_MCCR0_CLKHI_SHIFT             (8)
#define LPI2C_MCCR0_CLKHI_MASK              (0x3f << LPI2C_MCCR0_CLKHI_SHIFT)  /* Clock High Period */
#  define LPI2C_MCCR0_CLKHI(n)              ((n << LPI2C_MCCR0_CLKHI_SHIFT) & LPI2C_MCCR0_CLKHI_MASK)
                                                     /* Bits 15-14 Reserved */
#define LPI2C_MCCR0_SETHOLD_SHIFT           (16)
#define LPI2C_MCCR0_SETHOLD_MASK            (0x3f << LPI2C_MCCR0_SETHOLD_SHIFT)  /* Setup Hold Delay */
#  define LPI2C_MCCR0_SETHOLD(n)            ((n << LPI2C_MCCR0_SETHOLD_SHIFT) & LPI2C_MCCR0_SETHOLD_MASK)
                                                     /* Bits 23-22 Reserved */
#define LPI2C_MCCR0_DATAVD_SHIFT            (24)
#define LPI2C_MCCR0_DATAVD_MASK             (0x3f << LPI2C_MCCR0_DATAVD_SHIFT)  /* Setup Hold Delay */
#  define LPI2C_MCCR0_DATAVD(n)             ((n << LPI2C_MCCR0_DATAVD_SHIFT) & LPI2C_MCCR0_DATAVD_MASK)
                                                     /* Bits 31-30 Reserved */

/* LPI2C Master Clock Configuration Register 1 */

#define LPI2C_MCCR1_CLKLO_SHIFT             (0)
#define LPI2C_MCCR1_CLKLO_MASK              (0x3f << LPI2C_MCCR1_CLKLO_SHIFT)  /* Clock Low Period */
#  define LPI2C_MCCR1_CLKLO(n)              ((n << LPI2C_MCCR1_CLKLO_SHIFT) & LPI2C_MCCR1_CLKLO_MASK)
                                                     /* Bits 7-6 Reserved */
#define LPI2C_MCCR1_CLKHI_SHIFT             (8)
#define LPI2C_MCCR1_CLKHI_MASK              (0x3f << LPI2C_MCCR1_CLKHI_SHIFT)  /* Clock High Period */
#  define LPI2C_MCCR1_CLKHI(n)              ((n << LPI2C_MCCR1_CLKHI_SHIFT) & LPI2C_MCCR1_CLKHI_MASK)
                                                     /* Bits 15-14 Reserved */
#define LPI2C_MCCR1_SETHOLD_SHIFT           (16)
#define LPI2C_MCCR1_SETHOLD_MASK            (0x3f << LPI2C_MCCR1_SETHOLD_SHIFT)  /* Setup Hold Delay */
#  define LPI2C_MCCR1_SETHOLD(n)            ((n << LPI2C_MCCR1_SETHOLD_SHIFT) & LPI2C_MCCR1_SETHOLD_MASK)
                                                     /* Bits 23-22 Reserved */
#define LPI2C_MCCR1_DATAVD_SHIFT            (24)
#define LPI2C_MCCR1_DATAVD_MASK             (0x3f << LPI2C_MCCR1_DATAVD_SHIFT)  /* Setup Hold Delay */
#  define LPI2C_MCCR1_DATAVD(n)             ((n << LPI2C_MCCR1_DATAVD_SHIFT) & LPI2C_MCCR1_DATAVD_MASK)
                                                     /* Bits 31-30 Reserved */

/* LPI2C Master FIFO Control Register */

#define LPI2C_MFCR_TXWATER_SHIFT            (0)
#define LPI2C_MFCR_TXWATER_MASK             (3 << LPI2C_MFCR_TXWATER_SHIFT)  /* Transmit FIFO Watermark*/

#  define LPI2C_MFCR_TXWATER(n)             ((n << LPI2C_MFCR_TXWATER_SHIFT) &  LPI2C_MFCR_TXWATER_MASK)  /* Transmit FIFO Watermark*/

                                                     /* Bits 15-2 Reserved */
#define LPI2C_MFCR_RXWATER_SHIFT            (16)
#define LPI2C_MFCR_RXWATER_MASK             (3 << LPI2C_MFCR_RXWATER_SHIFT)  /* Receive FIFO Watermark */

#  define LPI2C_MFCR_RXWATER(n)             ((n << LPI2C_MFCR_RXWATER_SHIFT) &  LPI2C_MFCR_RXWATER_MASK)  /* Transmit FIFO Watermark*/

                                                     /* Bits 31-18 Reserved */

/* LPI2C Master FIFO Status Register */

#define LPI2C_MFSR_TXCOUNT_SHIFT            (0)
#define LPI2C_MFSR_TXCOUNT_MASK             (3 << LPI2C_MFSR_TXCOUNT_SHIFT)  /* Transmit FIFO Count */

                                                     /* Bits 15-2 Reserved */
#define LPI2C_MFSR_RXCOUNT_SHIFT            (16)
#define LPI2C_MFSR_RXCOUNT_MASK             (3 << LPI2C_MFSR_RXCOUNT_SHIFT)  /* Receive FIFO Count */

                                                     /* Bits 31-18 Reserved */

/* LPI2C Master Transmit Data Register */

#define LPI2C_MTDR_DATA_SHIFT               (0)
#define LPI2C_MTDR_DATA_MASK                (0xff << LPI2C_MTDR_DATA_SHIFT)  /* Transmit Data */
#  define LPI2C_MTDR_DATA(n)                (n & LPI2C_MTDR_DATA_MASK)
#define LPI2C_MTDR_CMD_SHIFT                (8)
#define LPI2C_MTDR_CMD_MASK                 (7 << LPI2C_MTDR_CMD_SHIFT)  /* Command Data */
#  define LPI2C_MTDR_CMD(n)                 ((n << LPI2C_MTDR_CMD_SHIFT) & LPI2C_MTDR_CMD_MASK)
#  define LPI2C_MTDR_CMD_TXD                (0 << LPI2C_MTDR_CMD_SHIFT)
#  define LPI2C_MTDR_CMD_RXD                (1 << LPI2C_MTDR_CMD_SHIFT)
#  define LPI2C_MTDR_CMD_STOP               (2 << LPI2C_MTDR_CMD_SHIFT)
#  define LPI2C_MTDR_CMD_RXD_DISC           (3 << LPI2C_MTDR_CMD_SHIFT)
#  define LPI2C_MTDR_CMD_START              (4 << LPI2C_MTDR_CMD_SHIFT)
#  define LPI2C_MTDR_CMD_START_NACK         (5 << LPI2C_MTDR_CMD_SHIFT)
#  define LPI2C_MTDR_CMD_START_HI           (6 << LPI2C_MTDR_CMD_SHIFT)
#  define LPI2C_MTDR_CMD_START_HI_NACK      (7 << LPI2C_MTDR_CMD_SHIFT)
                                                     /* Bits 31-11 Reserved */

/* LPI2C Master Receive Data Register */

#define LPI2C_MRDR_DATA_SHIFT               (0)
#define LPI2C_MRDR_DATA_MASK                (0xff << LPI2C_MRDR_DATA_SHIFT)  /* Receive Data */

                                                     /* Bits 13-8 Reserved */
#define LPI2C_MRDR_RXEMPTY_SHIFT            (14)
#define LPI2C_MRDR_RXEMPTY_MASK             (1 << LPI2C_MRDR_RXEMPTY_SHIFT)  /* Rx Empty */

                                                     /* Bits 31-15 Reserved */

/* LPI2C Slave Control Register */

#define LPI2C_SCR_SEN                       (1 << 0)  /* Slave Enable Bit */
#define LPI2C_SCR_RST                       (1 << 1)  /* Software Reset Bit */
                                                      /* Bits 3-2 Reserved */
#define LPI2C_SCR_FILTEN                    (1 << 4)  /* Filter Enable Bit */
#define LPI2C_SCR_FILTDZ                    (1 << 5)  /* Filter Doze Enable Bit */
                                                      /* Bits 7-4 Reserved */
#define LPI2C_SCR_RTF                       (1 << 8)  /* Reset Transmit FIFO Bit */
#define LPI2C_SCR_RRF                       (1 << 9)  /* Reset Receive FIFO Bit */
                                                      /* Bits 31-10 Reserved */

/* LPI2C Slave Status Register  */

