apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k1xx_lpi2c.h
#define LPI2C_SSR_TDF                       (1 << 0)  /* Transmit Data Flag Bit */
#define LPI2C_SSR_RDF                       (1 << 1)  /* Receive Data Flag Bit */
#define LPI2C_SSR_AVF                       (1 << 2)  /* Address Valid Flag Bit */
#define LPI2C_SSR_TAF                       (1 << 3)  /* Transmit ACK Flag Bit */
                                                      /* Bits 7-4 Reserved */
#define LPI2C_SSR_RSF                       (1 << 8)  /* Repeated Start Flag Bit */
#define LPI2C_SSR_SDF                       (1 << 9)  /* STOP Detect Flag Bit */
#define LPI2C_SSR_BEF                       (1 << 10) /* Bit Error Flag Bit */
#define LPI2C_SSR_FEF                       (1 << 11) /* FIFO Error Flag Bit */
#define LPI2C_SSR_AM0F                      (1 << 12) /* Address Match 0 Flag Bit */
#define LPI2C_SSR_AM1F                      (1 << 13) /* Address Match 1 Flag Bit */
#define LPI2C_SSR_GCF                       (1 << 14) /* General Call Flag Bit */
#define LPI2C_SSR_SARF                      (1 << 15) /* SMBus Alert Response Flag Bit */
                                                      /* Bits 23-16 Reserved */
#define LPI2C_MSR_SBF                       (1 << 24) /* Slave Busy Flag Bit */
#define LPI2C_MSR_BBF                       (1 << 25) /* Bus Busy Flag Bit */
                                                      /* Bits 31-26 Reserved */

/* LPI2C Slave Interrupt Enable Register  */

#define LPI2C_SIER_TDIE                     (1 << 0)  /* Transmit Data Interrupt Enable Bit */
#define LPI2C_SIER_RDIE                     (1 << 1)  /* Receive Data Interrupt Enable Bit */
#define LPI2C_SIER_AVIE                     (1 << 2)  /* Address Valid Interrupt Enable Bit */
#define LPI2C_SIER_TAIE                     (1 << 3)  /* Transmit ACK Interrupt Enable Bit */
                                                      /* Bits 7-4 Reserved */
#define LPI2C_SIER_RSIE                     (1 << 8)  /* Repeated Start Interrupt Enable Bit */
#define LPI2C_SIER_SDIE                     (1 << 9)  /* STOP Detect Interrupt Enable Bit */
#define LPI2C_SIER_BEIE                     (1 << 10) /* Bit Error Interrupt Enable Bit */
#define LPI2C_SIER_FEIE                     (1 << 11) /* FIFO Error Interrupt Enable Bit */
#define LPI2C_SIER_AM0IE                    (1 << 12) /* Address Match 0 Interrupt Enable Bit */
#define LPI2C_SIER_AM1IE                    (1 << 13) /* Address Match 1 Interrupt Enable Bit */
#define LPI2C_SIER_GCIE                     (1 << 14) /* General Call Interrupt Enable Bit */
#define LPI2C_SIER_SARIE                    (1 << 15) /* SMBus Alert Response Interrupt Enable Bit */
                                                      /* Bits 31-16 Reserved */

/* LPI2C Slave DMA Enable Register  */

#define LPI2C_SDER_TDDE                     (1 << 0)  /* Transmit Data DMA Enable Bit */
#define LPI2C_SDER_RDDE                     (1 << 1)  /* Transmit Data DMA Enable Bit */
#define LPI2C_SDER_AVDE                     (1 << 2)  /* Address Valid DMA Enable Bit */
                                                      /* Bits 31-3 Reserved */

/* LPI2C Slave Configuration Register 1  */

#define LPI2C_SCFGR1_ADRSTALL               (1 << 0)  /* Address SCL Stall */
#define LPI2C_SCFGR1_RXSTALL                (1 << 1)  /* RX SCL Stall */
#define LPI2C_SCFGR1_TXSTALL                (1 << 2)  /* TX Data SCL Stall */
#define LPI2C_SCFGR1_ACKSTALL               (1 << 3)  /* ACK SCL Stall */
                                                      /* Bits 7-4 Reserved */
#define LPI2C_SCFGR1_GCEN                   (1 << 8)  /* General Call Enable */
#define LPI2C_SCFGR1_SAEN                   (1 << 9)  /* SMBus Alert Enable */
#define LPI2C_SCFGR1_TXCFG                  (1 << 10) /* Transmit Flag Configuration */
#define LPI2C_SCFGR1_RXCFG                  (1 << 11) /* Receive Data Configuration */
#define LPI2C_SCFGR1_IFNACK                 (1 << 12) /* Ignore NACK */
#define LPI2C_SCFGR1_HSMEN                  (1 << 13) /* High Speed Mode Enable */
                                                      /* Bits 15-14 Reserved */
#define LPI2C_SCFG1_ADDRCFG_SHIFT           (16)
#define LPI2C_SCFG1_ADDRCFG_MASK            (7 << LPI2C_SCFG1_ADDRCFG_SHIFT)  /* Address Configuration Bit Mask */
#  define LPI2C_SCFG1_ADDRCFG(n)            ((n << LPI2C_SCFG1_ADDRCFG_SHIFT) & LPI2C_SCFG1_ADDRCFG_MASK)
#  define LPI2C_SCFG1_ADDRCFG0              (0 << LPI2C_SCFG1_ADDRCFG_SHIFT)
#  define LPI2C_SCFG1_ADDRCFG1              (2 << LPI2C_SCFG1_ADDRCFG_SHIFT)
#  define LPI2C_SCFG1_ADDRCFG2              (2 << LPI2C_SCFG1_ADDRCFG_SHIFT)
#  define LPI2C_SCFG1_ADDRCFG3              (3 << LPI2C_SCFG1_ADDRCFG_SHIFT)
#  define LPI2C_SCFG1_ADDRCFG4              (4 << LPI2C_SCFG1_ADDRCFG_SHIFT)
#  define LPI2C_SCFG1_ADDRCFG5              (5 << LPI2C_SCFG1_ADDRCFG_SHIFT)
#  define LPI2C_SCFG1_ADDRCFG6              (6 << LPI2C_SCFG1_ADDRCFG_SHIFT)
#  define LPI2C_SCFG1_ADDRCFG7              (7 << LPI2C_SCFG1_ADDRCFG_SHIFT)
                                                      /* Bits 31-19 Reserved */

/* LPI2C Slave Configuration Register 2  */

#define LPI2C_SCFG2_CLKHOLD_MASK            (15 << 0) /* Clock Hold Time */
#  define LPI2C_SCFG2_CLKHOLD(n)            (n & LPI2C_SCFG2_CLKHOLD_MASK)
                                                      /* Bits 7-4 Reserved */
#define LPI2C_SCFG2_DATAVD_SHIFT            (8)
#define LPI2C_SCFG2_DATAVD_MASK             (0x3f << LPI2C_SCFG2_DATAVD_SHIFT)  /* Data Valid Delay */
#  define LPI2C_SCFG2_DATAVD(n)             ((n << LPI2C_SCFG2_DATAVD_SHIFT) & LPI2C_SCFG2_DATAVD_MASK)
                                                      /* Bits 15-14 Reserved */
#define LPI2C_SCFG2_FILTSCL_SHIFT           (16)
#define LPI2C_SCFG2_FILTSCL_MASK            (15 << LPI2C_SCFG2_FILTSCL_SHIFT)  /* Glitch Filter SCL */
#define LPI2C_SCFG2_FILTSCL_DISABLE         (0 << LPI2C_SCFG2_FILTSCL_SHIFT)
#  define LPI2C_SCFG2_FILTSCL_CYCLES(n)     ((n << LPI2C_SCFG2_FILTSCL_SHIFT) & LPI2C_SCFG2_FILTSCL_MASK)
                                                      /* Bits 23-20 Reserved */
#define LPI2C_SCFG2_FILTSDA_SHIFT           (24)
#define LPI2C_SCFG2_FILTSDA_MASK            (15 << LPI2C_SCFG2_FILTSDA_SHIFT)  /* Glitch Filter SDA */
#define LPI2C_SCFG2_FILTSDA_DISABLE         (0 << LPI2C_SCFG2_FILTSDA_SHIFT)
#  define LPI2C_SCFG2_FILTSDA_CYCLES(n)     ((n << LPI2C_SCFG2_FILTSDA_SHIFT) & LPI2C_SCFG2_FILTSDA_MASK)
                                                      /* Bits 31-28 Reserved */

/* LPI2C Slave Address Match Register  */

                                                      /* Bit 0 Reserved */
#define LPI2C_SAMR_ADDR0_SHIFT              (1)
#define LPI2C_SAMR_ADDR0_MASK               (0x3ff << LPI2C_SAMR_ADDR0_SHIFT)  /* Address 0 Value */
#  define LPI2C_SAMR_ADDR0(n)               ((n << LPI2C_SAMR_ADDR0_SHIFT) & LPI2C_SAMR_ADDR0_MASK)
                                                      /* Bits 16-11 Reserved */
#define LPI2C_SAMR_ADDR1_SHIFT              (17)
#define LPI2C_SAMR_ADDR1_MASK               (0x3ff << LPI2C_SAMR_ADDR1_SHIFT)  /* Address 1 Value */
#  define LPI2C_SAMR_ADDR1(n)               ((n << LPI2C_SAMR_ADDR1_SHIFT) & LPI2C_SAMR_ADDR1_MASK)
                                                      /* Bits 31-27 Reserved */

/* LPI2C Slave Address Status Register  */

#define LPI2C_SASR_RADDR_MASK               (0x7ff << 0) /* Received Address */

                                                    /* Bits 16-11 Reserved */
#define LPI2C_SASR_ANV                      (1 << 14) /* Address Not Valid */
                                                      /* Bits 31-15 Reserved */

/* LPI2C Slave Transmit ACK Register  */

#define LPI2C_STAR_TXNACK                   (1 << 0)  /* Transmit NACK */
                                                      /* Bits 31-1 Reserved */

/* LPI2C Slave Transmit Data Register  */

#define LPI2C_STDR_DATA_SHIFT               (0)
#define LPI2C_STDR_DATA_MASK                (0xff << LPI2C_STDR_DATA_SHIFT)  /* Transmit Data */
#  define LPI2C_STDR_DATA(n)                ((n << LPI2C_STDR_DATA_SHIFT) & LPI2C_STDR_DATA_MASK)
                                                      /* Bits 31-8 Reserved */

/* LPI2C Slave Receive Data Register  */

#define LPI2C_SRDR_DATA_SHIFT               (0)
#define LPI2C_SRDR_DATA_MASK                (0xff << LPI2C_SRDR_DATA_SHIFT)  /* Receive Data */
#  define LPI2C_SRDR_DATA(n)                ((n << LPI2C_SRDR_DATA_SHIFT) & LPI2C_SRDR_DATA_MASK)
                                                      /* Bits 8-31 Reserved */

#endif /* __ARCH_ARM_SRC_S32K1XX_HARDWARE_S32K1XX_LPI2C_H */
